Fixing mermaid errors
